In [1]:
#missing values
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('weather_data.csv')
df

          day  temperature  windspeed  event
0  01-01-2017         32.0        6.0   Rain
1  01-02-2017          NaN        7.0  Sunny
2  01-03-2017         28.0        NaN   Snow
3  01-04-2017          NaN        7.0    NaN
4  01-05-2017         32.0        NaN   Rain
5  01-06-2017         31.0        2.0  Sunny
6  01-06-2017         34.0        5.0    NaN

In [3]:
type(df.day[0])

str

In [4]:
type(df)

pandas.core.frame.DataFrame

In [5]:
df.set_index('day')

            temperature  windspeed  event
day
01-01-2017         32.0        6.0   Rain
01-02-2017          NaN        7.0  Sunny
01-03-2017         28.0        NaN   Snow
01-04-2017          NaN        7.0    NaN
01-05-2017         32.0        NaN   Rain
01-06-2017         31.0        2.0  Sunny
01-06-2017         34.0        5.0    NaN

In [6]:
new_df = df.fillna(0)
new_df

          day  temperature  windspeed  event
0  01-01-2017         32.0        6.0   Rain
1  01-02-2017          0.0        7.0  Sunny
2  01-03-2017         28.0        0.0   Snow
3  01-04-2017          0.0        7.0      0
4  01-05-2017         32.0        0.0   Rain
5  01-06-2017         31.0        2.0  Sunny
6  01-06-2017         34.0        5.0      0

In [7]:
new_df = df.fillna({'temperature' : 0, 'wind' : 0, 'event' : 'no event'})
new_df

          day  temperature  windspeed     event
0  01-01-2017         32.0        6.0      Rain
1  01-02-2017          0.0        7.0     Sunny
2  01-03-2017         28.0        NaN      Snow
3  01-04-2017          0.0        7.0  no event
4  01-05-2017         32.0        NaN      Rain
5  01-06-2017         31.0        2.0     Sunny
6  01-06-2017         34.0        5.0  no event

In [8]:
#forward filling
new_df = df.fillna(method = 'ffill')
new_df

C:\Users\User\AppData\Local\Temp\ipykernel_15144\3927068626.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  new_df = df.fillna(method = 'ffill')

          day  temperature  windspeed  event
0  01-01-2017         32.0        6.0   Rain
1  01-02-2017         32.0        7.0  Sunny
2  01-03-2017         28.0        7.0   Snow
3  01-04-2017         28.0        7.0   Snow
4  01-05-2017         32.0        7.0   Rain
5  01-06-2017         31.0        2.0  Sunny
6  01-06-2017         34.0        5.0  Sunny

In [9]:
new_df = df.fillna(method = 'bfill')
new_df

C:\Users\User\AppData\Local\Temp\ipykernel_15144\3918601632.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  new_df = df.fillna(method = 'bfill')

          day  temperature  windspeed  event
0  01-01-2017         32.0        6.0   Rain
1  01-02-2017         28.0        7.0  Sunny
2  01-03-2017         28.0        7.0   Snow
3  01-04-2017         32.0        7.0   Rain
4  01-05-2017         32.0        2.0   Rain
5  01-06-2017         31.0        2.0  Sunny
6  01-06-2017         34.0        5.0    NaN

In [10]:
df.dropna()

          day  temperature  windspeed  event
0  01-01-2017         32.0        6.0   Rain
5  01-06-2017         31.0        2.0  Sunny

In [11]:
df.dropna(axis = 1)

          day
0  01-01-2017
1  01-02-2017
2  01-03-2017
3  01-04-2017
4  01-05-2017
5  01-06-2017
6  01-06-2017

In [12]:
df.dropna(axis = 0)

          day  temperature  windspeed  event
0  01-01-2017         32.0        6.0   Rain
5  01-06-2017         31.0        2.0  Sunny

In [13]:
#merging, joining and concatenation
df1 = pd.DataFrame({'A' : [ 'A0', 'A1', 'A2', 'A3'],
                    'B' : ['B0',  'B1', 'B2', 'B3'],
                    'C' : ['C0', 'C1', 'C2', 'C3']},
                     index = [0, 1, 2, 3])

In [14]:
df2 = pd.DataFrame({'A' : ['A4', 'A5' ,'A6', 'A7'],
                   'B' : ['B4', 'B5', 'B6', 'B7'],
                   'C' : ['C4', 'C5', 'C6', 'C7']},
                    index = [4, 5, 6, 7])

In [15]:
df3 = pd.DataFrame({'A' : ['A8', 'A9' ,'A10', 'A11'],
                   'B' : ['B8', 'B9', 'B10', 'B11'],
                   'C' : ['C8', 'C9', 'C10', 'C11']},
                    index = [8, 9, 10, 11])

In [16]:
df1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3

In [17]:
df2

    A   B   C
4  A4  B4  C4
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7

In [18]:
df3

      A    B    C
8    A8   B8   C8
9    A9   B9   C9
10  A10  B10  C10
11  A11  B11  C11

In [19]:
pd.concat([df1, df2, df3], axis = 1)

      A    B    C    A    B    C    A    B    C
0    A0   B0   C0  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN   A4   B4   C4  NaN  NaN  NaN
5   NaN  NaN  NaN   A5   B5   C5  NaN  NaN  NaN
6   NaN  NaN  NaN   A6   B6   C6  NaN  NaN  NaN
7   NaN  NaN  NaN   A7   B7   C7  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8
9   NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9
10  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10
11  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11

In [20]:
pd.concat([df1, df2, df3], axis = 0)

      A    B    C
0    A0   B0   C0
1    A1   B1   C1
2    A2   B2   C2
3    A3   B3   C3
4    A4   B4   C4
5    A5   B5   C5
6    A6   B6   C6
7    A7   B7   C7
8    A8   B8   C8
9    A9   B9   C9
10  A10  B10  C10
11  A11  B11  C11

In [21]:
#merging/joining
left = pd.DataFrame({'key1' : ['k0', 'k0', 'k1', 'k2'],
                     'key2' : ['k0', 'k1', 'k0', 'k1'],
                       'A'  :  ['A0', 'A1', 'A2', 'A3'],
                       'B'  :  ['B0', 'B1', 'B2', 'B3']})

In [22]:
right = pd.DataFrame({'key1' : ['k0', 'k1', 'k1', 'k2'],
                     'key2' : ['k0', 'k0', 'k0', 'k0'],
                       'C'  :  ['C0', 'C1', 'C2', 'C3'],
                       'D'  :  ['D0', 'D1', 'D2', 'D3']})

In [23]:
left

  key1 key2   A   B
0   k0   k0  A0  B0
1   k0   k1  A1  B1
2   k1   k0  A2  B2
3   k2   k1  A3  B3

In [24]:
right

  key1 key2   C   D
0   k0   k0  C0  D0
1   k1   k0  C1  D1
2   k1   k0  C2  D2
3   k2   k0  C3  D3

In [25]:
pd.merge(left, right, how = 'outer', on = ['key1', 'key2'])

  key1 key2    A    B    C    D
0   k0   k0   A0   B0   C0   D0
1   k0   k1   A1   B1  NaN  NaN
2   k1   k0   A2   B2   C1   D1
3   k1   k0   A2   B2   C2   D2
4   k2   k0  NaN  NaN   C3   D3
5   k2   k1   A3   B3  NaN  NaN

In [26]:
pd.merge(left, right, how = 'right', on = ['key1', 'key2'])

  key1 key2    A    B   C   D
0   k0   k0   A0   B0  C0  D0
1   k1   k0   A2   B2  C1  D1
2   k1   k0   A2   B2  C2  D2
3   k2   k0  NaN  NaN  C3  D3